# Задача 26:  Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.

# def st(a, b):
#     if b < 2: 
#       return a
#     return st(a, b - 1) * a

# list = input('Введите два числа через пробел: ').split()
# print(st(int(list[0]), int(list[1])))

# print(st(3, 9))

# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел.

# def summ(a, b):
#     if b < 1:
#         return a
#     return summ(a, b - 1) + 1


# list = input('Введите два числа через пробел: ').split()

# print(summ(int(list[0]), int(list[1])))

